{
  "irVersion": "3",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "com.mydomain",
  "graph": {
    "node": [
      {
        "input": [
          "Brands"
        ],
        "output": [
          "Brands0"
        ],
        "name": "LabelEncoder",
        "opType": "LabelEncoder",
        "attribute": [
          {
            "name": "classes_strings",
            "strings": [
              "Ymlqb3U=",
              "c2FpbnNidXJ5LXMsYnktc2FpbnNidXJ5LXM=",
              "dHJhZGVyLWpvZS1z",
              "Zm9vZC1jbHVi",
              "dG9ybi1nbGFzc2Vy",
              "bWFya3Mtc3BlbmNlcg==",
              "bS1z",
              "cGlsZ3JpbS1qb2Utcw==",
              "Z3JpenpsaWVz",
              "dW5maQ==",
              "ZGFkZHktcy1tdWVzbGk=",
              "ZXF1YWwtZXhjaGFuZ2U=",
              "c3VucmlkZ2U=",
              "cGNj",
              "bmV3LWVuZ2xhbmQtbmF0dXJhbHM=",
              "d2hvbGVzb21lLHdob2xlc29tZS1zd2VldGVuZXJz",
              "dHJhZGVyLWdpb3R0by1z",
              "bWFya3Mtc3BlbmNlcixtLXM=",
              "Y29va3NpbXBsZQ==",
              "Y3Jvd24tcGFjaWZpYy1maW5lLWZvb2Rz",
              "ZmxldXJ5LW1pY2hvbg==",
              "Z29sZGVuLXRlbXBsZQ==",
              "bGllYmln",
              "bmFwb2xlb24=",
              "Z2FyZGVudGltZQ==",
              "c2ltcGx5LW0tcyxtYXJrcy1zcGVuY2Vy",
              "Ym9iLXMtcmVkLW1pbGw=",
              "dml2YS1sYS1zYWx1ZA==",
              "bm9ydGhnYXRlLW1hcmtldA==",
              "bm90LWEtYnJhbmRlZC1pdGVt",
              "a2V0dGxlLGtldHRsZS1mb29kcw==",
              "a2lkLXBpY2tz",
              "dGFzdGUtYWR2ZW50dXJl",
              "bWFyaW4=",
              "d29vZHN0b2Nr",
              "am9lLXMtZGluZXI=",
              "cGNjLWZhcm1sYW5kLXRydXN0",
              "bWFya3MtYW5kLXNwZW5jZXI=",
              "bm9ydGhnYXRl",
              "dG9ybi1nbGFzc2Vz",
              "c2FpbnNidXJ5LXM=",
              "dHJhZGUtam9lLXM=",
              "Y29vbWJzLWZhbWlseQ==",
              "YWx0ZXItZWNv",
              "Y2Itcy1udXRz",
              "dHJhZGVyLXMtam9l",
              "YnVubnktbHV2",
              "Y29mZmVh",
              "bWFya3Mtc3BlbmNlcixtLXMsY291bnQtb24tdXM=",
              "dHJhZGVyLWpvc2Utcw==",
              "ZXNzZW50aWFsLWV2ZXJ5ZGF5",
              "dHJhZGVyLWpvZS1zLG5hcG9saS1zLWl0YWxpYW4tYmFrZXJ5",
              "Ynktc2FpbnNidXJ5LXM=",
              "c2ltcGx5LW0tcw==",
              "c2FpbnNidXJ5LXMsc2FpbnNidXJ5LXMtdGFzdGUtdGhlLWRpZmZlcmVuY2U=",
              "bWFya3Mtc3BlbmNlcixzYWluc2J1cnktcw==",
              "bWFya3Mtc3BlbmNlcixtYXJrcy1hbmQtc3BlbmNlcg==",
              "Zy1zdXBlcg==",
              "Z2x1dGlubw==",
              "c2FpbnNidXJ5LXMtdGFzdGUtdGhlLWRpZmZlcmVuY2Usc2FpbnNidXJ5LXM=",
              "c2FpbnNidXJ5LXMtYmFzaWNzLHNhaW5zYnVyeS1z",
              "Ynktc2FpbnNidXJ5LXMsc2FpbnNidXJ5LXM=",
              "bS1zLG1hcmtzLXNwZW5jZXI=",
              "bWFya3Mtc3BlbmNlcixjb3VudC1vbi11cw==",
              "cGFybWE=",
              "bWFya3M=",
              "ZWF0LXdlbGw=",
              "a2lya2xhbmQtc2lnbmF0dXJl",
              "dHJhZGVyLW1pbmctcw==",
              "b3JnYW5pY3M=",
              "bWFyaW8tYmF0YWxp",
              "Zm9vZC1saW9u",
              "dHJhZGl0aW9uYWwtbGF0a2VzLHRyYWRlci1qb2Utcw==",
              "bWFyay1zcGVuY2Vy",
              "dHJhZGVyLXMtam9lLXM=",
              "bS1zLG1hcmstc3BlbmNlcg==",
              "c2FpbnNidXJ5LXMsc2FpbnNidXJ5LXMtc28tb3JnYW5pYw==",
              "bWFya3Mtc3BlbmNlcixzaW1wbHktbS1z",
              "ZHVuY2FuLWhpbmVz",
              "aG9uZXljdXA=",
              "YmFrZXItam9zZWYtcw==",
              "dHJhZGVyLWphY3F1ZXM=",
              "dHJhZGVyLWpvZXM=",
              "c2FpbnNidXJ5",
              "dHJhZGVyLWpvZS1zLHRyYWRlci1qb2Utcw==",
              "c3VuLW1haWQ=",
              "Y29vay13aXRoLW0tcyxtYXJrcy1zcGVuY2Vy",
              "Y3JhdGUtYmFycmVs",
              "Ym9uZHVlbGxl",
              "bWFya3Mtc3BlbmNlcixzaW1wbHktbWFya3Mtc3BlbmNlcg==",
              "aG9uZWVz",
              "bGEtbnVlc3RyYQ==",
              "c2ltcGx5LW1z",
              "dHJhZGVyLWpvZS1zYW4=",
              "dHJhZ2VyLWpvZS1z",
              "Y2Fyb2wtcy1jb29raWVz",
              "dG9zY2Fubw==",
              "bWludXRlLW1haWQ=",
              "c2ltcGx5LW1hcmtzLXNwZW5jZXIsbWFya3Mtc3BlbmNlcg==",
              "dHJhZGVyLWRhcndpbi1z",
              "dHJhZGVyLWpvZQ==",
              "dml0YXJyb3o=",
              "bWFya3Mtc3BlbmNlcixtYXJrLXNwZW5jZXI=",
              "bWFya3Mtc3BlbmNlcixtYXJrcy1zcGVuY2VyLWFjdGl2ZWhlYWx0aA==",
              "dGFvcy1qb2Utcw==",
              "bWFya3Mtc3BlbmNlcix0cmFkZXItam9lLXM=",
              "dHJhZGVyLWpvZS1zLGNvbW1lZC1pbnRlcm5hdGlvbmFsLWNvcnA=",
              "cmlwLXJvbGxz",
              "bS1zLHRyYWRlci1qb2Utcw==",
              "bWFya3Mtc3BlbmNlcixzcGlyaXQtb2Ytc3VtbWVy",
              "YW1iYXNzYWRvci1jYXJkcw==",
              "dHJhZGVyLWpvZS1zLGhvbmV5d2VsbC1pbnRlcm5hdGlvbmFsLWluYw==",
              "bWFya3Mtc3BlbmNlcixtYXJrcy1zcGVuY2VyLWNvbGxlY3Rpb24=",
              "c2FpbnNidXJ5LXMsc2FpbnNidXJ5LXMtYmFzaWNz",
              "a3JvZ2Vy",
              "ZmVycmVybyxudXRlbGxh",
              "c2FpbnNidXJ5LXMtYmFzaWNz",
              "YXF1YWZpbmE=",
              "bXRuLWRldyxtb3VudGFpbi1kZXc=",
              "cGVwc2k=",
              "c2FpbnNidXJ5LXMtc28tb3JnYW5pYyxzYWluc2J1cnktcw==",
              "c3RyYXRodmFsZQ==",
              "bW91bnRhaW4tZGV3",
              "YnJpc2ssbGlwdG9uLHVuaWxldmVy",
              "c2luc2J1cnktcw==",
              "aGVpbno=",
              "amFjay1kYW5pZWwtcw==",
              "ZnVrdQ==",
              "amFjay1kYW5pZWxz",
              "ZGVsdXhlLGxpZGwtc3RpZnR1bmctY28ta2c=",
              "c2FpbnNidXJ5LXMtYmFzaWMsc2FpbnNidXJ5LXM=",
              "ZGVsLW1vbnRl",
              "YmFyLXMtZm9vZHMtY28=",
              "YmFyLXM=",
              "a2luZGVyLGZlcnJlcm8=",
              "c2FpbnNidXJ5LXMtc28tb3JnYW5pYw==",
              "c2FpbnN1YnVyeS1z",
              "c2FpbnNidXJ5LXMsdGFzdGUtdGhlLWRpZmZlcmVuY2U=",
              "c2FpbnNidXJ5LXMtdGFzdGUtdGhlLWRpZmZlcmVuY2U=",
              "c2FpbnNidXJ5LXMtZnJlZWZyb20sc2FpbnNidXJ5LXM=",
              "YW5oZXVzZXItYnVzY2gtaW5iZXY=",
              "c2FpbnNidXJ5cyxzYWluc2J1cnktcw==",
              "c3VlYmVl",
              "Y2xvdmVyLHN1ZWJlZQ==",
              "c2lvdXgtaG9uZXktYXNzb2NpYXRpb24=",
              "YXVudC1zdWUtcw==",
              "c2lvdXgtaG9uZXktYXNzLW4=",
              "c3dlZXQtdmFsbGV5",
              "dGhlLXZhcnNpdHk=",
              "cGhpbGFkZWxwaGlh",
              "c2hvcHJpdGU=",
              "Y3JhY2tlci1iYXJyZWw=",
              "YnJlYWtzdG9uZS1z",
              "ZGVsbW9udGUtZ2FyZGVuLXF1YWxpdHk=",
              "ZGVsLW1vbnRlLGRlbC1tb250ZS1mb29kcw==",
              "c2ltcGx5",
              "aHVyc3Qtcy1oYW1iZWVucyxoYW1iZWVucyxodXJzdCxodXJzdC1z",
              "YXRoZW5vcw==",
              "bi1rLWh1cnN0LWNv",
              "aHVyc3Qtcw==",
              "ZGF2aWQ=",
              "cGFjaWZpYyxwYWNpZmljLW95c3Rlci1jbw==",
              "Z3JhdnktbWFzdGVy",
              "dGVzY28=",
              "bXVsbGVy",
              "bXVsbGVyLXF1Y2tlci1kYWlyeS1sbGM=",
              "cXVha2Vy",
              "bWVpamVy",
              "a29oaW5vb3I=",
              "dGVzY28tZmluZXN0",
              "bmlnaHRpbmdhbGUtZmFybXMsdGVzY28=",
              "bW9uaW5p",
              "aG9ybWVsLWZvb2Rz",
              "aGVyYm8tb3g=",
              "aG9ybWVsLWZvb2QtbGxj",
              "aGVyYi1veA==",
              "aG9ybWVsLWZvb2RzLWxsYw==",
              "am9uZXMtZGFpcnktZmFybQ==",
              "aGVyc2hleS1z",
              "a2l0a2F0",
              "cmVlc2Utcw==",
              "aGVhdGg=",
              "YmFjay10by1uYXR1cmU=",
              "Y2hpLWNoaS1z",
              "ZmlyZWhvdXNl",
              "YnVzaC1z",
              "ay1jbGFzc2lj",
              "bWFycy1jaG9jb2xhdGUsbWFycw==",
              "bGluZHQsbGluZHQtZXhjZWxsZW5jZQ==",
              "Y2xhc3NpY28=",
              "Y2xhc3NpY28sbmV3LXdvcmxkLXBhc3RhLWNvbXBhbnk=",
              "c3dpbmc=",
              "bGlwdG9u",
              "bGlwdG9uLHVuaWxldmVy",
              "a2lra29tYW4sa2lra29tYW4tc2FsZXMtdXNhLWluYw==",
              "bmVzdGxlLGNhaWxsZXI=",
              "ZnJlbmNoLXMsdGhlLWZyZW5jaC1zLWZvb2QtY29tcGFueQ==",
              "YWxtb25kLWJyZWV6ZSxibHVlLWRpYW1vbmQtYWxtb25kcyxibHVlLWRpYW1vbmQtZ3Jvd2Vycy1jb3Jwb3JhdGlvbg==",
              "ZnJlbmNoLXMsZnJlbmNoLXM=",
              "Y2hlcnJ5LW1hbg==",
              "Z29sZC1z",
              "Z29sZC1wdXJlLWZvb2QtcHJvZHVjdHMtY28taW5j",
              "am95dmE=",
              "am95dmEtY29ycA==",
              "d2VsY2gtcw==",
              "b2xkLWRvbWluaW9uLWJyZXdpbmctY28=",
              "c2hhc3RhLHNoYXN0YS1iZXZlcmFnZXM=",
              "YWx3YXlzLXNhdmUsc2hhc3RhLWJldmVyYWdlcw==",
              "bWlv",
              "Y3JhY292aWE=",
              "bWF4d2VsbC1ob3VzZSxtYXh3ZWxsLWhvdXNlLWludGVybmF0aW9uYWw=",
              "bWF4d2VsbC1ob3VzZSx0aGUtYW1lcmljYW4tdG9iYWNjby1jb21wYW55",
              "bWF4d2VsbC1ob3VzZQ==",
              "a29vbC1haWQ=",
              "bWlvLG1pby1lbmVyZ3k=",
              "Y3J5c3RhbC1saWdodA==",
              "aG9uZXktbWFpZCxuYWJpc2Nv",
              "cGFsYXp6bw==",
              "Z2lvdmFubmktZmVycmFyaQ==",
              "bWF0YQ==",
              "dW5kZXJ3b29k",
              "c2VsbC1z",
              "Yi1t",
              "bG9hY2tlcg==",
              "Y2hpY2tlbi1vZi10aGUtc2Vh",
              "bW9tLXMtYmVzdC1jZXJlYWxz",
              "ZG9sbWlv",
              "Y29jYS1jb2xh",
              "Y2FyYW1iYXI=",
              "Y3VsaW5hcmlh",
              "Y29udGluZW50YWwtZm9vZC1iZXZlcmFnZQ==",
              "Y29sZXMsY29sZXMtc21hcnQtYnV5",
              "Ym9rYWRvcw==",
              "bGVhLXBlcnJpbnMtaW5j",
              "c3R1YmItcw==",
              "Y2FrZS1tYXRl",
              "YmVlY2gtbnV0LW51dHJpdGlvbi1jb21wYW55",
              "YmVlY2gtbnV0",
              "bWNjb3JtaWNr",
              "YXN0aWctZ291cm1ldA==",
              "Z295YQ==",
              "Ym9yZGVu",
              "ZWxzaWUtYm9yZGVu",
              "dG9tLXRvbQ==",
              "a25vdXNlLWZvb2RzLWluYw==",
              "dHJpZGVudA==",
              "c2hvcC1yaXRl",
              "Ympvcmc=",
              "Z3JhY2U=",
              "cG9zdA==",
              "a2xhc3M=",
              "bWNjb3JtaWNrLG1jY29ybWljay1nb3VybWV0",
              "Y2FkYnVyeQ==",
              "Y2FuYWRhLWRyeQ==",
              "d2VzdG1pbnN0ZXI=",
              "a2VsbG9nZy1z",
              "a2VuLXMtc3RlYWstaG91c2U=",
              "ZGUtY2VjY28sZi1pbGwtZGUtY2VjY28tZGktZmlsaXBwby1mYXJhLXMtbWFydGluby1zLXAtYQ==",
              "a29oaW5vb3Itc3BlY2lhbGl0eS1mb29kcy1pbmRpYS1wdnQtbHRk",
              "bGFpdGVyaWUtYW50b2luZS1nYXJteQ==",
              "aWNlbGFuZA==",
              "Y29jYS1jb2xhLGNva2UsZGlldC1jb2tlLGNva2UtZGlldGU=",
              "dmVnYW4tZGVsaQ==",
              "Ymx1ZS1kaWFtb25k",
              "bWlrZWU=",
              "Z3JlYXQtb2NlYW4=",
              "bWFyemV0dGksdC1tYXJ6ZXR0aS1jb21wYW55",
              "bWFyemV0dGk=",
              "b2RlbnNlLW1hcmNpcGFu",
              "ZWRla2EtYmlv",
              "Ym9va2JpbmRlci1z",
              "aGlkZGVuLXZhbGxleSx0aGUtaHYtZm9vZC1wcm9kdWN0cy1jbw==",
              "bGlmZXRpbWU=",
              "aGlkZGVuLXZhbGxleQ==",
              "bWFyaWUtcw==",
              "cGlja2FwZXBwYS1jb21wYW55LWx0ZA==",
              "dG9mZmlmYXk=",
              "bmVzdGxlLWRlc3NlcnQ=",
              "bGFzY2Nv",
              "bmFuY2Utcw==",
              "Z29sZGVuLWJsb3Nzb20=",
              "Z29sZGVuLWJsb3Nzb20taG9uZXk=",
              "ZGFpc3k=",
              "Y2Fyb2xpbmEtdHJlZXQtaW5j",
              "d2luc29yLXByb2R1Y3RzLWNvbWFwYW55LWluYw==",
              "d2luLXNjaHVsZXItcw==",
              "d2luLXNjaHVsZXItZm9vZHM=",
              "YmFrZWQtaW4tYnJvb2tseW4=",
              "cGVycmllcg==",
              "ZGVhbi1z",
              "d2V5YXV3ZWdhLXN0YXItZGFpcnk=",
              "c3Rhci1kYWlyeQ==",
              "ZWwtY2hhcnJpdG8=",
              "c2hvcHBlcnMtdmFsdWU=",
              "ZHItcGVwcGVy",
              "Ymx1ZS1oYXJib3ItZmlzaC1jbw==",
              "c3Rhcmtpc3Qtc2VsZWN0cw==",
              "YmFyaWxsYQ==",
              "ZWRla2EtaXRhbGlh",
              "bW91bnRhaW4tY291bnRyeQ==",
              "Z3J1bWEtY29ycG9yYXRpb24=",
              "ZGUtd2FmZWxiYWtrZXJzLWxsYw==",
              "ZnJlc2gtZWFzeQ==",
              "cmVmcmVzaGUsc2FmZXdheQ==",
              "cGFwcHktcy1maW5lLWZvb2Q=",
              "cGFwcHktcy1maW5lLWZvb2Rz",
              "Y2FzaW5v",
              "dGlwdHJlZSx3aWxraW4tc29ucy1sdGQ=",
              "dGVsbWE=",
              "aHkta28tcHJvZHVjdHMtY28=",
              "YXNkYSxhc2RhLWV4dHJhLXNwZWNpYWw=",
              "Ym9uLWNvbnRlbnQtbHRk",
              "YXNkYQ==",
              "Yy1o",
              "Zm9ydC1rbm94",
              "bmV3LWNvdmVudC1nYXJkZW4tc291cC1jbw==",
              "YnVtYmxlLWJlZQ==",
              "c2VzbWFyaw==",
              "YnVtYmxlLWJlZS1mb29kcyxidW1ibGUtYmVl",
              "cGVwcGVyaWRnZS1mYXJt",
              "Z3JlZW4tYmxhY2stcw==",
              "Y3VsaW5hcnktY2lyY2xl",
              "Y3Jvd24tY29uZmVjdGlvbmVyeS1jby1sdGQ=",
              "Y2FyZGVuYXM=",
              "aGFyaWJv",
              "bW9ycmlzb25z",
              "cGFic3QtYnJld2luZy1jb21wYW55",
              "d29ua2EsbmVyZHM=",
              "bmV3bWFuLXMtb3du",
              "YWxpY2UtZGVsaWNl",
              "N3VwLHBlcHNpY28=",
              "Y2Fub2xhLWhhcnZlc3Q=",
              "dG9kYXktcy10ZW1wdGF0aW9ucw==",
              "YmUta2luZA==",
              "bXQtb2xpdmU=",
              "bGFjdGFpZA==",
              "YWxsZml0bmVzc2ZhY3RvcnktZGU=",
              "aW50ZXJtYXJjaGU=",
              "b2NlYW4tbWlzdC1mYXJtcw==",
              "c2ltcGx5LHNpbXBseS1uYXR1cmFsLWZvb2RzLWxsYw==",
              "Y2FuZHktY3J1c2g=",
              "YW5ncnktYmlyZHM=",
              "YWxwaW5hLGNhdWNhLXpvbmEtZnJhbmNhLXMtYS1z",
              "dmludGFnZSx2aW50YWdlLWJlZQ==",
              "dmludGFnZS1iZWUtaW5j",
              "dmludGFnZSx2aW50YWdlLWJlZS1pbmM=",
              "Z3VpbHRsZXNzLWdvdXJtZXQ=",
              "Ymx1ZS1jaGlwLWdyb3Vw",
              "YmVydGFnbmk=",
              "YmlnLWs=",
              "YmFzaWMtYW1lcmljYW4tZm9vZHM=",
              "cm91bmR5LXM=",
              "c3BhcnRhbg==",
              "ZGlldC1tb3VudGFpbi1kZXc=",
              "bXRuLWRldw==",
              "YW5uaWUtcw==",
              "YmV0dHktbG91LXMtaW5j",
              "ZG9uYS1yaXRh",
              "c3dlZGlzaC1ieS1uYXR1cmU=",
              "dG91cGFyZ2Vs",
              "d2lubi1kaXhpZQ==",
              "Y2hlaw==",
              "Y3JvdXM=",
              "Y3JvdXMtcmVzdG8sY3JvdXM=",
              "ZmVybWUtZGUtbGEtZnJlbW9uZGllcmU=",
              "Y3JvdXMtcmVzdG8=",
              "Y3JvdXNyZXN0bw==",
              "bmF0dXJhNGV2ZXI=",
              "dml0YXNwZWx0",
              "Y29tbWUtai1haW1l",
              "bWFycXVlLXJlcGVyZS1wbGFudGF0aW9u",
              "YmxlZGluYQ==",
              "YWdvcmE=",
              "YS13",
              "bXgz",
              "a2l0Y2hlbi1hY2FkZW15",
              "YWxpY2UtZGVsaWNlcw==",
              "Y3lyaWwtbGlnbmFj",
              "Z2lhbnQsZnJlc2gtZWFzeQ==",
              "ai1kLWdyb3Nz",
              "dmljaHk=",
              "cmVlc2U=",
              "a3VobmU=",
              "bS1tLXMsbWFycyxtYXJzLWNob2NvbGF0",
              "cm9iZXJ0c29uLXM=",
              "cm9zZS1z",
              "ZHVlcnItcw==",
              "ZWFzdGVyLXVubGltaXRlZC1pbmM=",
              "Ym9mcm9zdA==",
              "Ym8tZnJvc3Q=",
              "ZGlldHdvcmxk",
              "Y2l0dGVyaW8=",
              "bWFybWl0ZQ==",
              "Ym92ZXR0aQ==",
              "bWlsa3l3YXk=",
              "bWN2aXRpZS1z",
              "c2hhcndvb2Qtcw==",
              "d2lzZS13b29kd29ya3M=",
              "Z29vZGUtcy1iYWtlcnktY28taW5j",
              "d2FsdG9uLXMtZmxpZXM=",
              "YnVsay1wb3dkZXJz",
              "cml0dGVyLXNwb3J0LGFsZnJlZC1yaXR0ZXItZ21iaC1jbw==",
              "cml0dGVyLXNwb3J0",
              "cml0dGVyLXNwb3J0LGFsZnJlZC1yaXR0ZXItZ21iaC1jby1rZw==",
              "cGV0cHJvLXByb2R1Y3RzLWluYw==",
              "YmFydC1qdWR5LXM=",
              "Y2hpbw==",
              "bGluZHQscG9sby1sZWF0aGVyZ29vZHM=",
              "a2FyZWxlYQ==",
              "Z2VuaXVz",
              "bWFkZWxhaW5lLWNob2NvbGF0ZS1ub3ZlbHRpZXM=",
              "dGhlLW1hZGVsYWluZS1jaG9jb2xhdGUtY29tcGFueQ==",
              "bWFkZWxhaW5lLWNob2NvbGF0ZS1ub3ZlbHRpZXMtaW5j",
              "aW5ub3ZhdGl2ZS1jYW5keS1jb25jZXB0cw==",
              "Y2Vhbi1taXN0LWZhcm1z",
              "b2NlYW4tbWlzdA==",
              "YmV0dGVyLWlkZWFz",
              "a2VlcHNha2U=",
              "cnlhbi1vcmNoYXJkcw==",
              "c29iZSxoZWFsdGh5LWZvb2QtYnJhbmRzLWxsYw==",
              "aGVhbHRoeS1mb29kLWJyYW5kcy1sbGM=",
              "d2VsY2gtcyxoZWFsdGh5LWZvb2QtYnJhbmRzLWxsYw==",
              "ZnJ1aXQtbmluamE=",
              "Zm9ydHdlbmdlcg==",
              "dmludGFnZSxhbGwtYW1lcmljYW4tcHJvZHVjdHMtY28taW5j",
              "bWF4ZmllbGQ=",
              "Z3VpbHRsZXNzLWdvdXJtZXQtaW5j",
              "bnV0ZWxsYQ==",
              "c292aXZv",
              "YmFsb2Njbw==",
              "dGhlLWtyb2dlci1jbw==",
              "a3JvZ2VyLHRoZS1rcm9nZXItY28=",
              "c2ltcGxlLXRydXRoLW9yZ2FuaWM=",
              "a2lra29tYW4sa2lra29tYW4tY29ycG9yYXRpb24=",
              "c2FsdWQtdml2YQ==",
              "dGFsa2luZ3JhaW4tYmV2ZXJhZ2UtY29tcGFueQ==",
              "aGFyaWJvLGhhcmliby1nbWJoLWNvLWtn",
              "d2VpbnJpY2gtcw==",
              "bWFya3Mtc3BlbmNlcixtYXJrcy1zcGVuY2Vy",
              "bGEtYmVyZ2VyaWU=",
              "cGF1bC1saW5o",
              "YWxpY2UtZXQtYmlv",
              "bmF0dXJhbGlh",
              "bmF0dXJlLWNpZQ==",
              "bWllbHMtdmlsbGVuZXV2ZQ==",
              "YW1hbmQtdGVycm9pcg==",
              "c29kZWJvLHNhbGFkZS1ldC1jb21wYWduaWU=",
              "dHJvcGljYW5h",
              "Z2F5ZWxvcmQtaGF1c2VyLW1pbmNldXI=",
              "Y2hhbGV1ci1jcmVvbGU=",
              "Y2hpb3N0cm8tZGktc2Fyb25ubw==",
              "aGVydGE=",
              "ZGVhci1tdWVzbGk=",
              "bGF3cnktcyxtY2Nvcm1pY2stY29tcGFueS1pbmM=",
              "aG9sLWdyYWlu",
              "dHJhZGVyLWpvZS1zLHN1cHJlbWUtZm9vZHMtaW5j",
              "ZWFydGgtcy1iZXN0",
              "aHV5LWZvbmctZm9vZHMtaW5j",
              "dHVvbmctb3Qtc3JpcmFjaGE=",
              "a3VjaGVubWVpc3Rlcg==",
              "dmVudHVyYS1mb29kcy1sLWwtYw==",
              "bWFpdHJlLXRydWZmb3V0",
              "a3JvZWdlcg==",
              "YmFrZXJ5LWZyZXNoLWdvb2RuZXNzLHRoZS1rcm9nZXItY28=",
              "a3JvZ2VyLGtyb2dlci1jbw==",
              "ZnJlZG1leWVy",
              "ZnJlZC1tZXllcg==",
              "cHJpdmF0ZS1zZWxlY3Rpb24=",
              "ZnJlc2g=",
              "cGVha2ZlY3Rpb24=",
              "aW50ZXItYW1lcmljYW4tcHJvZHVjdHM=",
              "Y2xvdmVyLXZhbGxleQ==",
              "c2ltcGxlLXRydXRo",
              "cHJpdmF0ZS1zZWxlY3Rpb24sdGhlLWtyb2dlci1jbw==",
              "dmFuLWRlLWthbXAtcw==",
              "dmFuLW9yLWthbXAtcw==",
              "c2ltcGxlLXRydXRoLW9yZ2FuaWMsdGhlLWtyb2dlci1jbw==",
              "a2V0dGxlLGtyb2dlcg==",
              "YmlnLWssdGhlLWtyb2dlci1jbw==",
              "cHJpdmF0ZS1zZWxlY3Rpb24scHJpdmF0ZS1zZWxlY3Rpb25z",
              "cHJpdmF5ZS1zZWxlY3Rpb24=",
              "a2luZy1zb29wZXJz",
              "cHNzdA==",
              "cC10",
              "cmFscGhz",
              "Y3Jpc3Asa3JvZ2Vy",
              "Y3Jlc2NlbnQsZmxha3k=",
              "c2ltcGxlLXRydWUtb3JnYW5pYw==",
              "c2ltcGxlLXRydXRoLHRoZS1rcm9nZXItY28=",
              "cC10LWJpZy1zYXZpbmdzLXBhc3MtaXQtb24=",
              "Y291bnRyeS1vdmVu",
              "c21pdGgtcw==",
              "cHJpdmF0ZS1zZWxlY3Q=",
              "bW91bnRhaW4tZGFpcnk=",
              "c2ltcGxlLXRydXRoLW9yZ2FuaWMsa3JvZ2Vy",
              "aGVtaXMtZmFyZXM=",
              "a3JvZ2VyLGZyZWQtbWV5ZXI=",
              "aGVtaXNmYXJlcw==",
              "c2ltcGx5LXRydXRo",
              "bm8tbW5hdWZhY3R1cmVy",
              "Y2xvdmVyLGtyb2dlcg==",
              "dmFuLWRlLWthbXAtcyx0aGUta3JvZ2VyLWNv",
              "YS1sYS1vcmRlbg==",
              "YWxhLW9yZGVu",
              "c2Vub3ItZ3VzdG8=",
              "MS0y",
              "c2ltcGx5LHRoZS1rcm9nZXItY28=",
              "Y3Jlc2NlbnQsa3JvZ2Vy",
              "c2ltcGxlLXRydXRoLW9yZ2FuaWMsc2ltcGxlLXRydXRo",
              "ZnJlc2gtc2VsZWN0aW9ucw==",
              "bmF0dXJhbGx5LXByZWZlcnJlZA==",
              "YmFrZXJ5LWZyZXNoLWdvb2RuZXNz",
              "cHJpdmF0ZS1zZWxlY3Rpb25z",
              "aGVyaXRhZ2UtZmFybQ==",
              "bWFuYWdlci1zLXNwZWNpYWw=",
              "YmxhY2stZm9yZXN0LGtyb2dlcg==",
              "dW5pbGV2ZXItaG9tZS1hbmQtcGVyc29uYWwtY2FyZS11c2E=",
              "YnVzY2gtcw==",
              "dW5pbGV2ZXI=",
              "ZnJ5aW4tbWFnaWM=",
              "YmFraW4tbWlyYWNsZQ==",
              "bWlyYWNsZS1tYWl6ZQ==",
              "ZmFzdC1zaGFrZQ==",
              "ZmlzY2hlci1z",
              "YmVzdC1hbWVyaWNhbi1mb29kcw==",
              "YmFzaWMtYW1lcmljYW4tZm9vZHMtaW5j",
              "c3BlY2lhbHR5LWJha2Vycw==",
              "c2ltcGx5LXJvdW5keS1z",
              "cm91bmR5LXMtc2VsZWN0",
              "cm91bmR5LXMscm91bmR5LXMtc2VsZWN0",
              "cm91bmR5cw==",
              "cm91bmRheS1z",
              "cm91ZHktcw==",
              "c2ltcGx5LXJvdW5keS1zLW9yZ2FuaWM=",
              "cm91bmR5cy1zdXBlcm1hcmtldA==",
              "c2ltcGx5LHNpbXBseS1yb3VuZHlz",
              "cm91bmR5LXMtc3VwZXJtYXJrZXRz",
              "bWFyaWFuby1z",
              "cm91bmR5LXMscm91bmR5LXMtc3VwZXJtYXJrZXRzLWluYw==",
              "c2ltcGx5LXJvdW5keS1zLHNpbXBseS1yb3VuZHktcy1vcmdhbmlj",
              "dG9kZHM=",
              "bW9udC1hbW9yZQ==",
              "d2lzY29uc2lu",
              "Y3Jlc2NlbnQscm91bmR5LXM=",
              "cm91bmR5LXMtc3VwZXJtYXJrZXRzLWluYw==",
              "cm91bmQtcy1zZWxlY3Q=",
              "cm91bmR5LXMsZ2tp",
              "c2ltcGx5LXJvdW5keS1zLGdraQ==",
              "cm91bmR5LXMscm91bmR5LXMtc3VwZXJtYXJrZXRz",
              "amVsbHktYmVsbHkscm91bmR5LXM=",
              "cm91bmR5LXMsYWxiYW5lc2UtY29uZmVjdGlvbmVyeS1ncm91cA==",
              "cm91bmR5LXMsYWxiYW1lbmUtY29uZmVjdGlvbmFyeS1ncm91cA==",
              "c2ltcGx5LXJvdW5keXM=",
              "amZjLWludGVybmF0aW9uYWwtaW5j",
              "ZHluYXN0eQ==",
              "d2VsLXBhYw==",
              "aGltZS1icmFuZA==",
              "aGFwaS10cmFkaW5n",
              "bXlvam8tZm9vZHMtY28tbHRk",
              "eWFtYS1tb3RvLXlhbWE=",
              "amZj",
              "aGltZQ==",
              "a2lra29tYW4=",
              "aGFwaQ==",
              "Ym90YW4=",
              "amZjLGpmYy1pbnRlcm5hdGlvbmFsLWluYw==",
              "ZHluYXN0eSxqZmMtaW50ZXJuYXRpb25hbC1pbmM=",
              "eWFtYW1vdG95YW1h",
              "a2lra29tYW4samZjLWludGVybmF0aW9uYWwtaW5j",
              "YWppc2hpbWEtZm9vZHMtY28tbHRk",
              "amZjLGFqaXNoaW1hLWZvb2RzLWNvLWx0ZA==",
              "bmlzaGlraQ==",
              "d2VscGFj",
              "d2VsLXBhYyx3ZWxwYWM=",
              "a2Ftb2ktc2hva3VoaW4ta29neW8tY28tbHRk",
              "bmFnYWk=",
              "a3lvc2hpbi1jb25mZWN0aW9uZXItY28tbHRk",
              "cnVjZS1jYWtlLW51cmk=",
              "c2VhZm9vZC10b25rb3RzdQ==",
              "dGFtYW5pc2hpa2k=",
              "d2FyYWt1LWNvLWx0ZA==",
              "Z2luYmlzLWZvdXItc2VhLWZvb2RzLXNoYW50b3UtY28tbHRk",
              "YWppc2hpbWE=",
              "bXlvam8=",
              "a2ltdXJh",
              "aGFwaS1zbmFja3M=",
              "a2FzdWdhaQ==",
              "dWRvbg==",
              "aW1wZXJpYWwtZHJhZ29u",
              "amZjLWludGVybmF0aW9uYWw=",
              "Zm9vZHRvd24taW5j",
              "Zm9vZHRvd24sZm9vZHRvd24taW5j",
              "Zm9vZHRvd24=",
              "Zm9vZHR3b24=",
              "c2h1ci1maW5l",
              "c2h1cmZpbmU=",
              "dG9wY28tYXNzb2NpYXRlcy1pbmM=",
              "c2h1cmZpbmUsdG9wY28tYXNzb2NpYXRlcy1pbmM=",
              "a2V0dGxlLHNodXJmaW5l",
              "c2h1ci1maW5lLHRvcGNvLWFzc29jaWF0ZXMtaW5j",
              "c2h1cmZyZXNo"
            ],
            "type": "STRINGS"
          },
          {
            "name": "default_int64",
            "i": "-1",
            "type": "INT"
          },
          {
            "name": "default_string",
            "type": "STRING"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Brands0"
        ],
        "output": [
          "Brands1"
        ],
        "name": "OneHotEncoder",
        "opType": "OneHotEncoder",
        "attribute": [
          {
            "name": "cats_int64s",
            "ints": [
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "19",
              "20",
              "21",
              "22",
              "23",
              "24",
              "25",
              "26",
              "27",
              "28",
              "29",
              "30",
              "31",
              "32",
              "33",
              "34",
              "35",
              "36",
              "37",
              "38",
              "39",
              "40",
              "41",
              "42",
              "43",
              "44",
              "45",
              "46",
              "47",
              "48",
              "49",
              "50",
              "51",
              "52",
              "53",
              "54",
              "55",
              "56",
              "57",
              "58",
              "59",
              "60",
              "61",
              "62",
              "63",
              "64",
              "65",
              "66",
              "67",
              "68",
              "69",
              "70",
              "71",
              "72",
              "73",
              "74",
              "75",
              "76",
              "77",
              "78",
              "79",
              "80",
              "81",
              "82",
              "83",
              "84",
              "85",
              "86",
              "87",
              "88",
              "89",
              "90",
              "91",
              "92",
              "93",
              "94",
              "95",
              "96",
              "97",
              "98",
              "99",
              "100",
              "101",
              "102",
              "103",
              "104",
              "105",
              "106",
              "107",
              "108",
              "109",
              "110",
              "111",
              "112",
              "113",
              "114",
              "115",
              "116",
              "117",
              "118",
              "119",
              "120",
              "121",
              "122",
              "123",
              "124",
              "125",
              "126",
              "127",
              "128",
              "129",
              "130",
              "131",
              "132",
              "133",
              "134",
              "135",
              "136",
              "137",
              "138",
              "139",
              "140",
              "141",
              "142",
              "143",
              "144",
              "145",
              "146",
              "147",
              "148",
              "149",
              "150",
              "151",
              "152",
              "153",
              "154",
              "155",
              "156",
              "157",
              "158",
              "159",
              "160",
              "161",
              "162",
              "163",
              "164",
              "165",
              "166",
              "167",
              "168",
              "169",
              "170",
              "171",
              "172",
              "173",
              "174",
              "175",
              "176",
              "177",
              "178",
              "179",
              "180",
              "181",
              "182",
              "183",
              "184",
              "185",
              "186",
              "187",
              "188",
              "189",
              "190",
              "191",
              "192",
              "193",
              "194",
              "195",
              "196",
              "197",
              "198",
              "199",
              "200",
              "201",
              "202",
              "203",
              "204",
              "205",
              "206",
              "207",
              "208",
              "209",
              "210",
              "211",
              "212",
              "213",
              "214",
              "215",
              "216",
              "217",
              "218",
              "219",
              "220",
              "221",
              "222",
              "223",
              "224",
              "225",
              "226",
              "227",
              "228",
              "229",
              "230",
              "231",
              "232",
              "233",
              "234",
              "235",
              "236",
              "237",
              "238",
              "239",
              "240",
              "241",
              "242",
              "243",
              "244",
              "245",
              "246",
              "247",
              "248",
              "249",
              "250",
              "251",
              "252",
              "253",
              "254",
              "255",
              "256",
              "257",
              "258",
              "259",
              "260",
              "261",
              "262",
              "263",
              "264",
              "265",
              "266",
              "267",
              "268",
              "269",
              "270",
              "271",
              "272",
              "273",
              "274",
              "275",
              "276",
              "277",
              "278",
              "279",
              "280",
              "281",
              "282",
              "283",
              "284",
              "285",
              "286",
              "287",
              "288",
              "289",
              "290",
              "291",
              "292",
              "293",
              "294",
              "295",
              "296",
              "297",
              "298",
              "299",
              "300",
              "301",
              "302",
              "303",
              "304",
              "305",
              "306",
              "307",
              "308",
              "309",
              "310",
              "311",
              "312",
              "313",
              "314",
              "315",
              "316",
              "317",
              "318",
              "319",
              "320",
              "321",
              "322",
              "323",
              "324",
              "325",
              "326",
              "327",
              "328",
              "329",
              "330",
              "331",
              "332",
              "333",
              "334",
              "335",
              "336",
              "337",
              "338",
              "339",
              "340",
              "341",
              "342",
              "343",
              "344",
              "345",
              "346",
              "347",
              "348",
              "349",
              "350",
              "351",
              "352",
              "353",
              "354",
              "355",
              "356",
              "357",
              "358",
              "359",
              "360",
              "361",
              "362",
              "363",
              "364",
              "365",
              "366",
              "367",
              "368",
              "369",
              "370",
              "371",
              "372",
              "373",
              "374",
              "375",
              "376",
              "377",
              "378",
              "379",
              "380",
              "381",
              "382",
              "383",
              "384",
              "385",
              "386",
              "387",
              "388",
              "389",
              "390",
              "391",
              "392",
              "393",
              "394",
              "395",
              "396",
              "397",
              "398",
              "399",
              "400",
              "401",
              "402",
              "403",
              "404",
              "405",
              "406",
              "407",
              "408",
              "409",
              "410",
              "411",
              "412",
              "413",
              "414",
              "415",
              "416",
              "417",
              "418",
              "419",
              "420",
              "421",
              "422",
              "423",
              "424",
              "425",
              "426",
              "427",
              "428",
              "429",
              "430",
              "431",
              "432",
              "433",
              "434",
              "435",
              "436",
              "437",
              "438",
              "439",
              "440",
              "441",
              "442",
              "443",
              "444",
              "445",
              "446",
              "447",
              "448",
              "449",
              "450",
              "451",
              "452",
              "453",
              "454",
              "455",
              "456",
              "457",
              "458",
              "459",
              "460",
              "461",
              "462",
              "463",
              "464",
              "465",
              "466",
              "467",
              "468",
              "469",
              "470",
              "471",
              "472",
              "473",
              "474",
              "475",
              "476",
              "477",
              "478",
              "479",
              "480",
              "481",
              "482",
              "483",
              "484",
              "485",
              "486",
              "487",
              "488",
              "489",
              "490",
              "491",
              "492",
              "493",
              "494",
              "495",
              "496",
              "497",
              "498",
              "499",
              "500",
              "501",
              "502",
              "503",
              "504",
              "505",
              "506",
              "507",
              "508",
              "509",
              "510",
              "511",
              "512",
              "513",
              "514",
              "515",
              "516",
              "517",
              "518",
              "519",
              "520",
              "521",
              "522",
              "523",
              "524",
              "525",
              "526",
              "527",
              "528",
              "529",
              "530",
              "531",
              "532",
              "533",
              "534",
              "535",
              "536",
              "537",
              "538",
              "539",
              "540",
              "541",
              "542",
              "543",
              "544",
              "545",
              "546",
              "547",
              "548",
              "549",
              "550",
              "551",
              "552",
              "553",
              "554",
              "555",
              "556",
              "557",
              "558",
              "559",
              "560",
              "561",
              "562",
              "563",
              "564",
              "565",
              "566",
              "567",
              "568",
              "569",
              "570",
              "571",
              "572",
              "573",
              "574",
              "575",
              "576",
              "577",
              "578",
              "579",
              "580",
              "581",
              "582",
              "583",
              "584",
              "585",
              "586",
              "587",
              "588",
              "589",
              "590",
              "591",
              "592",
              "593",
              "594",
              "595",
              "596",
              "597",
              "598",
              "599",
              "600",
              "601"
            ],
            "type": "INTS"
          },
          {
            "name": "zeros",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Energy_100g",
          "Fat_100g",
          "SaturatedFat_100g",
          "TransFat_100g",
          "Cholesterol_100g",
          "Carbohydrates_100g",
          "Fiber_100g",
          "Proteins_100g",
          "Salt_100g",
          "Sodium_100g",
          "VitaminC_100g",
          "Calcium_100g",
          "Iron_100g",
          "Brands1"
        ],
        "output": [
          "Features"
        ],
        "name": "FeatureVectorizer",
        "opType": "FeatureVectorizer",
        "attribute": [
          {
            "name": "inputList",
            "strings": [
              "RW5lcmd5XzEwMGc=",
              "RmF0XzEwMGc=",
              "U2F0dXJhdGVkRmF0XzEwMGc=",
              "VHJhbnNGYXRfMTAwZw==",
              "Q2hvbGVzdGVyb2xfMTAwZw==",
              "Q2FyYm9oeWRyYXRlc18xMDBn",
              "RmliZXJfMTAwZw==",
              "UHJvdGVpbnNfMTAwZw==",
              "U2FsdF8xMDBn",
              "U29kaXVtXzEwMGc=",
              "Vml0YW1pbkNfMTAwZw==",
              "Q2FsY2l1bV8xMDBn",
              "SXJvbl8xMDBn",
              "QnJhbmRzMQ=="
            ],
            "type": "STRINGS"
          },
          {
            "name": "inputdimensions",
            "ints": [
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "601"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features"
        ],
        "output": [
          "Score"
        ],
        "name": "TreeEnsembleRegressor",
        "opType": "TreeEnsembleRegressor",
        "attribute": [
          {
            "name": "post_transform",
            "s": "Tk9ORQ==",
            "type": "STRING"
          },
          {
            "name": "n_targets",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "base_values",
            "floats": [
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "aggregate_function",
            "s": "U1VN",
            "type": "STRING"
          },
          {
            "name": "nodes_treeids",
            "ints": [
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
